In [1]:
from typing import List
import pandas as pd

### Creating a DataFrame from List
#### Write a solution to create a DataFrame from a 2D list called student_data. This 2D list contains the IDs and 
#### ages of some students.
#### The DataFrame should have two columns, student_id and age, and be in the same order as the original 2D list.

In [2]:
# Parameters:2D list containing student IDs and ages, Returns: DataFrame with two columns, student_id and age.
def createDataframe(student_data: List[List[int]]) -> pd.DataFrame:
# Define column names
    columns = ['student_id','age']
# Create DataFrame
    df = pd.DataFrame(student_data,columns = columns)
    return df
# Test the function with example data
student_data = [
    [1, 15],
    [2, 11],
    [3, 11],
    [4, 20]
]
createDataframe(student_data)

   student_id  age
0           1   15
1           2   11
2           3   11
3           4   20

### Get the size of a DataFrame
#### Write a solution to calculate and display the number of rows and columns of players.
#### Return the result as an array: [number of rows, number of columns]

In [3]:
players_data = {
    'player_id': [846, 749, 155, 583, 388, 883, 355, 247, 761, 642],
    'name': ['Mason', 'Riley', 'Bob', 'Isabella', 'Zachary', 'Ava', 'Violet', 'Thomas', 'Jack', 'Charlie'],
    'age': [21, 30, 28, 32, 24, 23, 18, 27, 33, 36],
    'position': ['Forward', 'Winger', 'Striker', 'Goalkeeper', 'Midfielder', 'Defender', 'Striker', 'Striker', 'Midfielder', 'Center-back'],
    'team': ['RealMadrid', 'Barcelona', 'ManchesterUnited', 'Liverpool', 'BayernMunich', 'Chelsea', 'Juventus', 'ParisSaint-Germain', 'ManchesterCity', 'Arsenal']
}

In [4]:
# Creating the DataFrame
players = pd.DataFrame(players_data)

In [5]:
# Defining the function
def getDataframesize(players: pd.DataFrame) -> List[int]:
    num_rows = players.shape[0]
    num_cols = players.shape[1]
    return[num_rows,num_cols]
# Testing the function
print(getDataframesize(players))

[10, 5]

### Display the First Three Rows
#### Write a solution to display the first 3 rows of this DataFrame.

In [6]:
employees_data = {
    'employee_id': [3, 90, 9, 60, 49, 43],
    'name': ['Bob', 'Alice', 'Tatiana', 'Annabelle', 'Jonathan', 'Khaled'],
    'department': ['Operations', 'Sales', 'Engineering', 'InformationTechnology', 'HumanResources', 'Administration'],
    'salary': [48675, 11096, 33805, 37678, 23793, 40454]
}

In [7]:
# Creating the Dataframe
employees = pd.DataFrame(employees_data)

In [8]:
#Defining the function
def selectFirstRows(employees: pd.DataFrame) -> pd.DataFrame:
    return employees.head(3)
print(selectFirstRows(employees))

   employee_id     name   department  salary
0            3      Bob   Operations   48675
1           90    Alice        Sales   11096
2            9  Tatiana  Engineering   33805

### Select Data
#### Write a solution to select the name and age of the student with student_id = 101.

In [9]:
student_data = {
    'student_id': [101,53,128,3],
    'name' : ['Ulysses','William','Henry','Henry'],
    'age' : [13,10,6,11]   
}

In [10]:
students = pd.DataFrame(student_data)
students

   student_id     name  age
0         101  Ulysses   13
1          53  William   10
2         128    Henry    6
3           3    Henry   11

In [11]:
def selectData(students: pd.DataFrame) -> pd.DataFrame:
    selected_student = students[students['student_id'] == 101]
    selected_info = selected_student[['name','age']]
    return selected_info
print(selectData(students))

      name  age
0  Ulysses   13

### Create a New Column
#### A company plans to provide its employees with a bonus.
#### Write a solution to create a new column name bonus that contains the doubled values of the salary column.

In [12]:
employees_data = {
    'name': ['Piper','Grace','Georgia','Willow','Finn','Thomas'],
    'salary': [4548,28150,1103,6593,74576,24433]
}
employees = pd.DataFrame(employees_data)
employees

      name  salary
0    Piper    4548
1    Grace   28150
2  Georgia    1103
3   Willow    6593
4     Finn   74576
5   Thomas   24433

In [13]:
def createBonusColumn(employees: pd.DataFrame) -> pd.DataFrame:
    employees['bonus'] = employees['salary']*2
    return employees
print(createBonusColumn(employees))

      name  salary   bonus
0    Piper    4548    9096
1    Grace   28150   56300
2  Georgia    1103    2206
3   Willow    6593   13186
4     Finn   74576  149152
5   Thomas   24433   48866

### Drop Duplicate Rows
#### There are some duplicate rows in the DataFrame based on the email column.
#### Write a solution to remove these duplicate rows and keep only the first occurrence.

In [14]:
customers_data = {
    'customer_id' : [1,2,3,4,5,6],
    'name' : ['Ella','David','Zachary','Alice','Finn','Violet'],
    'email' : ['emily@example.com','michael@example.com','sarah@example.com','john@example.com','john@example.com',
               'alice@example.com']
}
customers = pd.DataFrame(customers_data)
customers

   customer_id     name                email
0            1     Ella    emily@example.com
1            2    David  michael@example.com
2            3  Zachary    sarah@example.com
3            4    Alice     john@example.com
4            5     Finn     john@example.com
5            6   Violet    alice@example.com

In [15]:
def dropDuplicateEmails(customers: pd.DataFrame) -> pd.DataFrame:
    unique_customer = customers.drop_duplicates(subset = 'email',keep = 'first')
    return unique_customer
print(dropDuplicateEmails(customers))

   customer_id     name                email
0            1     Ella    emily@example.com
1            2    David  michael@example.com
2            3  Zachary    sarah@example.com
3            4    Alice     john@example.com
5            6   Violet    alice@example.com

### Drop Missing Data
#### There are some rows having missing values in the name column.
#### Write a solution to remove the rows with missing values.

In [16]:
student_data = {
    'student_id' : [32,217,779,849],
    'name' : ['Piper',None,'Georgia','Willow'],
    'age' : [5,19,20,14]
}
students = pd.DataFrame(student_data)
students

   student_id     name  age
0          32    Piper    5
1         217     None   19
2         779  Georgia   20
3         849   Willow   14

In [17]:
def dropMissingData(students: pd.DataFrame) -> pd.DataFrame:
    cleaned_data = students.dropna(subset = ['name'])
    return cleaned_data
print(dropMissingData(students))

   student_id     name  age
0          32    Piper    5
2         779  Georgia   20
3         849   Willow   14

### Modify Columns
#### A company intends to give its employees a pay rise.
#### Write a solution to modify the salary column by multiplying each salary by 2.

In [18]:
employees_data = {
    'name' : ['Jack','Piper','Mia','Ulysses'],
    'salary': [19666,74754,62509,54866]
}
employees = pd.DataFrame(employees_data)
employees

      name  salary
0     Jack   19666
1    Piper   74754
2      Mia   62509
3  Ulysses   54866

In [19]:
def modifySalaryColumn(employees: pd.DataFrame) -> pd.DataFrame:
    employees['salary'] = employees['salary'] * 2
    return employees
print(modifySalaryColumn(employees))

      name  salary
0     Jack   39332
1    Piper  149508
2      Mia  125018
3  Ulysses  109732

###  Rename Columns
#### Write a solution to rename the columns as follows:
#### id to student_id
#### first to first_name
#### last to last_name
#### age to age_in_years

In [20]:
students_data = {
    'id' : [1,2,3,4,5],
    'first': ['Mason','Ava','Taylor','Georgia','Thomas'],
    'last': ['King','Wright','Hall','Thompson','Moore'],
    'age' : [6,7,16,18,10]
}
students = pd.DataFrame(students_data)
students

   id    first      last  age
0   1    Mason      King    6
1   2      Ava    Wright    7
2   3   Taylor      Hall   16
3   4  Georgia  Thompson   18
4   5   Thomas     Moore   10

In [21]:
def renameColumns(students: pd.DataFrame) -> pd.DataFrame:
    rename_col = students.rename(columns = {'id' : 'student_id','first' : 'first_name','last' : 'last_name',
                                            'age' : 'age_in_years' })
    return rename_col
print(renameColumns(students))

   student_id first_name last_name  age_in_years
0           1      Mason      King             6
1           2        Ava    Wright             7
2           3     Taylor      Hall            16
3           4    Georgia  Thompson            18
4           5     Thomas     Moore            10

### Change Data Type
#### Write a solution to correct the errors:
#### The grade column is stored as floats, convert it to integers.

In [22]:
students_data = {
    'student_id' : [1,2],
    'name' : ['Ava','Kate'],
    'age' : [6,15],
    'grade' : [73.0,87.0]
}
students = pd.DataFrame(students_data)
students

   student_id  name  age  grade
0           1   Ava    6   73.0
1           2  Kate   15   87.0

In [23]:
def changeDatatype(students: pd.DataFrame) -> pd.DataFrame:
    students['grade'] = students['grade'].astype(int)
    return students
print(changeDatatype(students))

   student_id  name  age  grade
0           1   Ava    6     73
1           2  Kate   15     87

###  Fill Missing Data
#### Write a solution to fill in the missing value as 0 in the quantity column.

In [24]:
products_data = {
    'name' : ['Wristwatch','WirelessEarbuds','GolfClubs','Printer'],
    'quantity': [None,None,779,849],
    'price ' : [135,821,9319,3051]
}
products = pd.DataFrame(products_data)
products

              name  quantity  price
0       Wristwatch       NaN     135
1  WirelessEarbuds       NaN     821
2        GolfClubs     779.0    9319
3          Printer     849.0    3051

In [25]:
def fillMissingValues(products: pd.DataFrame) -> pd.DataFrame:
    products['quantity'].fillna(0,inplace = True)
    return products
print(fillMissingValues(products))

              name  quantity  price
0       Wristwatch       0.0     135
1  WirelessEarbuds       0.0     821
2        GolfClubs     779.0    9319
3          Printer     849.0    3051

### Reshape Data : Concatenate
#### Write a solution to concatenate these two DataFrames vertically into one DataFrame.

In [26]:
student1 = {
    'student_id' : [1,2,3,4],
    'name' : ['Mason','Ava','Taylor','Georgia'],
    'age' : [8,6,15,17]
}

student2 = {
    'student_id' : [5,6],
    'name' : ['Leo','Alex'],
    'age' : [7,7]
}

df1 = pd.DataFrame(student1)
df2 = pd.DataFrame(student2)

In [27]:
df1

   student_id     name  age
0           1    Mason    8
1           2      Ava    6
2           3   Taylor   15
3           4  Georgia   17

In [28]:
df2

   student_id  name  age
0           5   Leo    7
1           6  Alex    7

In [29]:
def concatenateTables(df1: pd.DataFrame, df2: pd.DataFrame) -> pd.DataFrame:
    concat_df = pd.concat([df1,df2]).reset_index(drop = True)
    return concat_df
print(concatenateTables(df1,df2))

   student_id     name  age
0           1    Mason    8
1           2      Ava    6
2           3   Taylor   15
3           4  Georgia   17
4           5      Leo    7
5           6     Alex    7

### Reshape Data: Pivot
#### Write a solution to pivot the data so that each row represents temperatures for a specific month, and each city is a separate column.

In [30]:
weather_data = {
    'city' : ['Jacksonville','Jacksonville','Jacksonville','Jacksonville','Jacksonville',
              'ElPaso','ElPaso','ElPaso','ElPaso','ElPaso'],
    'month' : ['January','February','March','April','May','January','February','March','April','May'],
    'temperature' : [13,23,38,5,34,20,6,26,2,43]
}
weather = pd.DataFrame(weather_data)
weather

           city     month  temperature
0  Jacksonville   January           13
1  Jacksonville  February           23
2  Jacksonville     March           38
3  Jacksonville     April            5
4  Jacksonville       May           34
5        ElPaso   January           20
6        ElPaso  February            6
7        ElPaso     March           26
8        ElPaso     April            2
9        ElPaso       May           43

In [31]:
def pivotTable(weather: pd.DataFrame) -> pd.DataFrame:
    pivot_df = weather.pivot(index = 'month',columns = 'city', values = 'temperature')
    return pivot_df
print(pivotTable(weather))

city      ElPaso  Jacksonville
month
April          2             5
February       6            23
January       20            13
March         26            38
May           43            34

### Reshape Data: Melt
#### Write a solution to reshape the data so that each row represents sales data for a product in a specific quarter.

In [32]:
report_data = {
    'product' : ['Umbrella','SleepingBag'],
    'quarter_1':[417,800],
    'quarter_2':[224,936],
    'quarter_3':[379,93],
    'quarter_4':[611,875]
}
report = pd.DataFrame(report_data)
report

       product  quarter_1  quarter_2  quarter_3  quarter_4
0     Umbrella        417        224        379        611
1  SleepingBag        800        936         93        875

In [33]:
def meltTable(report: pd.DataFrame) -> pd.DataFrame:
    report_melt = report.melt(id_vars ='product',var_name = 'quarter',value_name = 'sales')
    return report_melt
print(meltTable(report))

       product    quarter  sales
0     Umbrella  quarter_1    417
1  SleepingBag  quarter_1    800
2     Umbrella  quarter_2    224
3  SleepingBag  quarter_2    936
4     Umbrella  quarter_3    379
5  SleepingBag  quarter_3     93
6     Umbrella  quarter_4    611
7  SleepingBag  quarter_4    875

### Method Chaining
#### Write a solution to list the names of animals that weigh strictly more than 100 kilograms.
#### Return the animals sorted by weight in descending order.

In [34]:
animals_data = {
    'name' : ['Tatiana','Khaled','Alex','Jonathan','Stefan','Tommy'],
    'species' : ['Snake','Giraffe','Leopard','Monkey','Bear','Panda'],
    'age' : [98,50,6,45,100,26],
    'weight' : [464,41,328,463,50,349]
}
animals = pd.DataFrame(animals_data)
animals

       name  species  age  weight
0   Tatiana    Snake   98     464
1    Khaled  Giraffe   50      41
2      Alex  Leopard    6     328
3  Jonathan   Monkey   45     463
4    Stefan     Bear  100      50
5     Tommy    Panda   26     349

In [35]:
def findHeavyAnimals(animals: pd.DataFrame) -> pd.DataFrame:
    heavy_animals = animals[animals['weight']>100]
    sorted_heavy_animals = heavy_animals.sort_values(by='weight',ascending = False)
    names_heavy_animals = sorted_heavy_animals[['name']].reset_index(drop= True)
    return names_heavy_animals
print(findHeavyAnimals(animals))

       name
0   Tatiana
1  Jonathan
2     Tommy
3      Alex